# @Time : 2022/1/23 15:49 
# @Author : Jface 
# @desc :
"""
while循环嵌套: while里面包含while
步骤流程：先写外层的while，再写内层的while
需求：跑步 5 圈，每跑步1圈，做10个俯卧撑

外层 while 步骤流程：
# 1. 设置外层循环的条件变量 i， 赋值为0
# 2. 外层while 条件(i < 5)：
    # 3. 打印跑了第几圈
    # 4. 做10个俯卧撑内循环处理(先空着，不处理)
    # 5. 外层循环的条件变量改变

内层 while 步骤流程：
# 4.1 定义内层循环条件变量 j = 0
# 4.2 内层循环 while j < 10:
    # 4.3 打印第几个俯卧撑
    # 4.4 内层循环的条件变量改变
"""

# 外层 while 步骤流程：
# 1. 设置外层循环的条件变量 i， 赋值为0
i = 0

# 2. 外层while 条件(i < 5)：
while i < 5:

    # 3. 打印跑了第几圈
    print("跑了%d圈" % (i + 1))

    # 4. 做10个俯卧撑内循环处理(先空着，不处理)
    # 内层 while 步骤流程：
    # 4.1 定义内层循环条件变量 j = 0
    j = 0
    # 4.2 内层循环 while j < 10:
    while j < 10:
        # 4.3 打印第几个俯卧撑
        print("做了%d个俯卧撑" % (j + 1))
        # 4.4 内层循环的条件变量改变
        j += 1

    # 5. 外层循环的条件变量改变
    i += 1
